; domain
(define (domain sobokosnake)
(:requirements :typing :negative-preconditions)
(:types location direction - object)
(:predicates
    ;up down left right of a field
    (MOVE-DIR ?x ?y - location ?dir - direction)
    ;snake that has not eaten anything yet
    (thinsnake ?x - location)
    ;the last field of the snake
    (tailsnake ?x - location)
    ;the first field of the snake
    (headsnake ?x - location)
    ;pieces of the snake that are connected. from front to back
    (nextsnake ?x ?y - location)
    ;a field that is occupied by the snake or by a hole
    (blocked ?x - location)
    ;a field that has a point that can be collected by the snake
    (ispoint ?x - location)
    ;a field that is occupied by an obstacle
    (isbox ?x - location)
    ;a field that has a hole on it
    (ishole ?x - location)
)

(:action move-thin-snake
    ;move thin snake
    :parameters (?oldposition ?newposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?oldposition)
        (MOVE-DIR ?oldposition ?newposition ?dir)
        (not (blocked ?newposition))
        (not (ispoint ?newposition))
        (not (isbox ?newposition))
    )
    :effect
    (and
        (thinsnake ?newposition)
        (blocked ?newposition)
        (not (thinsnake ?oldposition))
        (not (blocked ?oldposition))
    )
)
(:action move-thin-snake-and-box
    ;move thin snake and push box
    :parameters (?oldposition ?newposition ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?oldposition)
        (MOVE-DIR ?oldposition ?newposition ?dir)
        (MOVE-DIR ?newposition ?newboxposition ?dir)
        (not (blocked ?newboxposition))
        (not (ispoint ?newposition))
        (isbox ?newposition)
        (not (isbox ?newboxposition))
        
    )
    :effect
    (and
        (thinsnake ?newposition)
        (blocked ?newposition)
        (not (thinsnake ?oldposition))
        (not (blocked ?oldposition))
        (not (isbox ?newposition))
        (isbox ?newboxposition)
    )
)
(:action move-thin-snake-and-box-to-hole
    ;move thin snake and push box to a hole
    :parameters (?oldposition ?newposition ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?oldposition)
        (MOVE-DIR ?oldposition ?newposition ?dir)
        (MOVE-DIR ?newposition ?newboxposition ?dir)
        (not (ispoint ?newposition))
        (isbox ?newposition)
        (ishole ?newboxposition)
        
    )
    :effect
    (and
        (thinsnake ?newposition)
        (blocked ?newposition)
        (not (thinsnake ?oldposition))
        (not (blocked ?oldposition))
        (not (isbox ?newposition))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)



(:action move-thin-snake-and-first-eat
    ;move thin snake and eat
    :parameters (?position ?newhead - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?position)
        (MOVE-DIR ?position ?newhead ?dir)
        (not (blocked ?newhead))
        (ispoint ?newhead)
        (not (isbox ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (tailsnake ?position)
        (nextsnake ?newhead ?position)
        (not (ispoint ?newhead))
        (not (thinsnake ?position))
    )
)
(:action move-box-and-first-eat
    ;move thin snake, push box and eat
    :parameters (?position ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?position)
        (MOVE-DIR ?position ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (not (blocked ?newboxposition))
        (ispoint ?newhead)
        (isbox ?newhead)
        (not (isbox ?newboxposition))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (tailsnake ?position)
        (nextsnake ?newhead ?position)
        (not (ispoint ?newhead))
        (not (thinsnake ?position))
        (not (isbox ?newhead))
        (isbox ?newboxposition)
    )
)
(:action move-box-to-hole-and-first-eat
    ;move thin snake, push box to a hole and eat
    :parameters (?position ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?position)
        (MOVE-DIR ?position ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (ispoint ?newhead)
        (isbox ?newhead)
        (ishole ?newboxposition)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (tailsnake ?position)
        (nextsnake ?newhead ?position)
        (not (ispoint ?newhead))
        (not (thinsnake ?position))
        (not (isbox ?newhead))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)
(:action move-fat-snake
    ;move snake
    :parameters (?head ?newhead ?tail ?newtail - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (blocked ?newhead))
        (not (ispoint ?newhead))
        (not (isbox ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
    )
)
(:action move-fat-snake-and-box
    ;move snake and push box
    :parameters (?head ?newhead ?tail ?newtail ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (blocked ?newboxposition))
        (not (ispoint ?newhead))
        (isbox ?newhead)
        (not (isbox ?newboxposition))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
        (not (isbox ?newhead))
        (isbox ?newboxposition)
    )
)
(:action move-fat-snake-and-box-to-hole
    ;move snake and push box to a hole
    :parameters (?head ?newhead ?tail ?newtail ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (ispoint ?newhead))
        (isbox ?newhead)
        (ishole ?newboxposition)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
        (not (isbox ?newhead))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)
(:action move-and-eat
    ;move snake and eat
    :parameters (?head ?newhead - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (not (blocked ?newhead))
        (ispoint ?newhead)
        (not (isbox ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
    )
)
(:action move-box-and-eat
    ;move snake, push box and eat
    :parameters (?head ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (not (blocked ?newboxposition))
        (ispoint ?newhead)
        (isbox ?newhead)
        (not (isbox ?newboxposition))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
        (not (isbox ?newhead))
        (isbox ?newboxposition)
    )
)
(:action move-box-to-hole-and-eat
    ;move snake, push box to a hole and eat
    :parameters (?head ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (ispoint ?newhead)
        (isbox ?newhead)
        (ishole ?newboxposition)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
        (not (isbox ?newhead))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)
)

; problem
(define (problem sobokosnake-1-2)
(:domain sobokosnake)
(:objects
    pos0-2 - location
    pos0-3 - location
    pos1-0 - location
    pos1-1 - location
    pos1-2 - location
    pos1-3 - location
    pos2-0 - location
    pos2-1 - location
    pos2-2 - location
    pos3-0 - location
    pos3-1 - location
    pos3-2 - location
    pos3-3 - location
    pos4-2 - location
    pos4-3 - location
    dir-right - direction
    dir-left - direction
    dir-up - direction
    dir-down - direction
)
(:init
    (MOVE-DIR pos0-2 pos1-2 dir-down)
    (MOVE-DIR pos0-2 pos0-3 dir-right)
    (MOVE-DIR pos0-3 pos1-3 dir-down)
    (MOVE-DIR pos0-3 pos0-2 dir-left)
    (MOVE-DIR pos1-0 pos2-0 dir-down)
    (MOVE-DIR pos1-0 pos1-1 dir-right)
    (MOVE-DIR pos1-1 pos2-1 dir-down)
    (MOVE-DIR pos1-1 pos1-2 dir-right)
    (MOVE-DIR pos1-1 pos1-0 dir-left)
    (MOVE-DIR pos1-2 pos1-3 dir-right)
    (MOVE-DIR pos1-2 pos1-1 dir-left)
    (MOVE-DIR pos1-2 pos0-2 dir-up)
    (MOVE-DIR pos1-2 pos2-2 dir-down)
    (MOVE-DIR pos1-3 pos0-3 dir-up)
    (MOVE-DIR pos1-3 pos1-2 dir-left)
    (MOVE-DIR pos2-0 pos2-1 dir-right)
    (MOVE-DIR pos2-0 pos1-0 dir-up)
    (MOVE-DIR pos2-0 pos3-0 dir-down)
    (MOVE-DIR pos2-1 pos1-1 dir-up)
    (MOVE-DIR pos2-1 pos2-2 dir-right)
    (MOVE-DIR pos2-1 pos2-0 dir-left)
    (MOVE-DIR pos2-1 pos3-1 dir-down)
    (MOVE-DIR pos2-2 pos1-2 dir-up)
    (MOVE-DIR pos2-2 pos2-1 dir-left)
    (MOVE-DIR pos2-2 pos3-2 dir-down)
    (MOVE-DIR pos3-0 pos2-0 dir-up)
    (MOVE-DIR pos3-0 pos3-1 dir-right)
    (MOVE-DIR pos3-1 pos2-1 dir-up)
    (MOVE-DIR pos3-1 pos3-2 dir-right)
    (MOVE-DIR pos3-1 pos3-0 dir-left)
    (MOVE-DIR pos3-2 pos3-3 dir-right)
    (MOVE-DIR pos3-2 pos3-1 dir-left)
    (MOVE-DIR pos3-2 pos2-2 dir-up)
    (MOVE-DIR pos3-2 pos4-2 dir-down)
    (MOVE-DIR pos3-3 pos4-3 dir-down)
    (MOVE-DIR pos3-3 pos3-2 dir-left)
    (MOVE-DIR pos4-2 pos3-2 dir-up)
    (MOVE-DIR pos4-2 pos4-3 dir-right)
    (MOVE-DIR pos4-3 pos3-3 dir-up)
    (MOVE-DIR pos4-3 pos4-2 dir-left)
    ;(tailsnake pos2-1)
    ;(headsnake pos2-1)
    (thinsnake pos2-1)
    (blocked pos2-1)
    (ispoint pos0-3)
    (ispoint pos1-0)
    (ispoint pos1-2)
    (ispoint pos2-0)
    (ispoint pos2-2)
    (ispoint pos3-0)
    (ispoint pos3-2)
    (ispoint pos4-3)
)
(:goal
(and
    (not (ispoint pos0-3))
    (not (ispoint pos1-0))
    (not (ispoint pos1-2))
    (not (ispoint pos2-0))
    (not (ispoint pos2-2))
    (not (ispoint pos3-0))
    (not (ispoint pos3-2))
    (not (ispoint pos4-3))
)
)
)

; plan
1. (move-thin-snake pos2-1 pos1-1 dir-up)
   deleted: (thinsnake pos2-1) (blocked pos2-1)
   added: (thinsnake pos1-1) (blocked pos1-1)
   goals met: 0 of 8
2. (move-thin-snake-and-first-eat pos1-1 pos1-2 dir-right)
   deleted: (ispoint pos1-2) (thinsnake pos1-1)
   added: (blocked pos1-2) (headsnake pos1-2) (tailsnake pos1-1) (nextsnake pos1-2 pos1-1)
   goals met: 1 of 8
3. (move-fat-snake pos1-2 pos0-2 pos1-1 pos1-2 dir-up)
   deleted: (headsnake pos1-2) (blocked pos1-1) (tailsnake pos1-1) (nextsnake pos1-2 pos1-1)
   added: (blocked pos0-2) (headsnake pos0-2) (nextsnake pos0-2 pos1-2) (tailsnake pos1-2)
   goals met: 1 of 8
4. (move-and-eat pos0-2 pos0-3 dir-right)
   deleted: (headsnake pos0-2) (ispoint pos0-3)
   added: (blocked pos0-3) (headsnake pos0-3) (nextsnake pos0-3 pos0-2)
   goals met: 2 of 8
5. (move-fat-snake pos0-3 pos1-3 pos1-2 pos0-2 dir-down)
   deleted: (headsnake pos0-3) (blocked pos1-2) (tailsnake pos1-2) (nextsnake pos0-2 pos1-2)
   added: (blocked pos1-3) (headsnake pos1-3) (nextsnake pos1-3 pos0-3) (tailsnake pos0-2)
   goals met: 2 of 8
6. (move-fat-snake pos1-3 pos1-2 pos0-2 pos0-3 dir-left)
   deleted: (headsnake pos1-3) (blocked pos0-2) (tailsnake pos0-2) (nextsnake pos0-3 pos0-2)
   added: (blocked pos1-2) (headsnake pos1-2) (nextsnake pos1-2 pos1-3) (tailsnake pos0-3)
   goals met: 2 of 8
7. (move-fat-snake pos1-2 pos1-1 pos0-3 pos1-3 dir-left)
   deleted: (headsnake pos1-2) (blocked pos0-3) (tailsnake pos0-3) (nextsnake pos1-3 pos0-3)
   added: (blocked pos1-1) (headsnake pos1-1) (nextsnake pos1-1 pos1-2) (tailsnake pos1-3)
   goals met: 2 of 8
8. (move-and-eat pos1-1 pos1-0 dir-left)
   deleted: (headsnake pos1-1) (ispoint pos1-0)
   added: (blocked pos1-0) (headsnake pos1-0) (nextsnake pos1-0 pos1-1)
   goals met: 3 of 8
9. (move-and-eat pos1-0 pos2-0 dir-down)
   deleted: (headsnake pos1-0) (ispoint pos2-0)
   added: (blocked pos2-0) (headsnake pos2-0) (nextsnake pos2-0 pos1-0)
   goals met: 4 of 8
10. (move-and-eat pos2-0 pos3-0 dir-down)
   deleted: (headsnake pos2-0) (ispoint pos3-0)
   added: (blocked pos3-0) (headsnake pos3-0) (nextsnake pos3-0 pos2-0)
   goals met: 5 of 8
11. (move-fat-snake pos3-0 pos3-1 pos1-3 pos1-2 dir-right)
   deleted: (headsnake pos3-0) (blocked pos1-3) (tailsnake pos1-3) (nextsnake pos1-2 pos1-3)
   added: (blocked pos3-1) (headsnake pos3-1) (nextsnake pos3-1 pos3-0) (tailsnake pos1-2)
   goals met: 5 of 8
12. (move-fat-snake pos3-1 pos2-1 pos1-2 pos1-1 dir-up)
   deleted: (headsnake pos3-1) (blocked pos1-2) (tailsnake pos1-2) (nextsnake pos1-1 pos1-2)
   added: (blocked pos2-1) (headsnake pos2-1) (nextsnake pos2-1 pos3-1) (tailsnake pos1-1)
   goals met: 5 of 8
13. (move-and-eat pos2-1 pos2-2 dir-right)
   deleted: (headsnake pos2-1) (ispoint pos2-2)
   added: (blocked pos2-2) (headsnake pos2-2) (nextsnake pos2-2 pos2-1)
   goals met: 6 of 8
14. (move-and-eat pos2-2 pos3-2 dir-down)
   deleted: (headsnake pos2-2) (ispoint pos3-2)
   added: (blocked pos3-2) (headsnake pos3-2) (nextsnake pos3-2 pos2-2)
   goals met: 7 of 8
15. (move-fat-snake pos3-2 pos4-2 pos1-1 pos1-0 dir-down)
   deleted: (headsnake pos3-2) (blocked pos1-1) (tailsnake pos1-1) (nextsnake pos1-0 pos1-1)
   added: (blocked pos4-2) (headsnake pos4-2) (nextsnake pos4-2 pos3-2) (tailsnake pos1-0)
   goals met: 7 of 8
16. (move-and-eat pos4-2 pos4-3 dir-right)
   deleted: (headsnake pos4-2) (ispoint pos4-3)
   added: (blocked pos4-3) (headsnake pos4-3) (nextsnake pos4-3 pos4-2)
   goals met: 8 of 8
